In [26]:
import mysql.connector

In [27]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="admin",
  database="mydatabase"
)

In [28]:
mycursor=mydb.cursor()

mycursor.execute("CREATE TABLE interns (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), phone_number INT)")

In [29]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('interns',)

In [25]:
mycursor.execute("Drop table interns")

In [30]:
mycursor.execute("ALTER TABLE interns MODIFY COLUMN phone_number VARCHAR(255)")

In [31]:
sql= "INSERT INTO interns(name,phone_number) VALUES(%s,%s)"
val = [
       ('John', "1234567890"),
       ('adil',"03338036635"),
       ('ahmed',"03338036632")
       ]
mycursor.executemany(sql,val)
mydb.commit()
print(mycursor.rowcount, "record inserted")

3 record inserted

In [32]:
mycursor.execute("SELECT * FROM interns")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'John', '1234567890')
(2, 'adil', '03338036635')
(3, 'ahmed', '03338036632')

In [33]:
sql = "SELECT * FROM interns WHERE phone_number ='03338036635'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(2, 'adil', '03338036635')

In [36]:
sql = "SELECT * FROM interns WHERE name LIKE '%med%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(3, 'ahmed', '03338036632')

In [37]:
sql = "SELECT * FROM interns ORDER BY name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(2, 'adil', '03338036635')
(3, 'ahmed', '03338036632')
(1, 'John', '1234567890')

In [38]:
sql = "DELETE FROM interns WHERE name = 'John'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

In [39]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS customers"

mycursor.execute(sql)

In [40]:
sql = "UPDATE interns SET name = 'Haisem' WHERE name = 'Adil'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [41]:
sql= "INSERT INTO interns(name,phone_number) VALUES(%s,%s)"
val = [
    ('Emily', "0987654321"),
    ('Michael', "0112233445"),
    ('Sarah', "0778899001"),
    ('Chris', "0912345678"),
    ('Taylor', "0321456789"),
    ('Jordan', "0432167890"),
    ('Liam', "0808080808"),
    ('Ava', "0909090909"),
    ('Noah', "1000100010")
]
mycursor.executemany(sql,val)
mydb.commit()
print(mycursor.rowcount, "record inserted")

9 record inserted

In [44]:
#If you want to return five records, starting from the third record, you can use the "OFFSET" keyword:
mycursor.execute("SELECT * FROM interns LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4, 'Emily', '0987654321')
(5, 'Michael', '0112233445')
(6, 'Sarah', '0778899001')
(7, 'Chris', '0912345678')
(8, 'Taylor', '0321456789')

In [45]:

mycursor.execute("""
CREATE TABLE IF NOT EXISTS users (
    id INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    fav INT
);
""")

mycursor.executemany("""
INSERT INTO users (id, name, fav) VALUES (%s, %s, %s);
""", [
    (1, 'John', 154),
    (2, 'Peter', 154),
    (3, 'Amy', 155),
    (4, 'Hannah', None),
    (5, 'Michael', None)
])

mycursor.execute("""
CREATE TABLE IF NOT EXISTS products (
    id INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL
);
""")

mycursor.executemany("""
INSERT INTO products (id, name) VALUES (%s, %s);
""", [
    (154, 'Chocolate Heaven'),
    (155, 'Tasty Lemons'),
    (156, 'Vanilla Dreams')
])


mydb.commit()

print("Tables created and data inserted successfully.")

Tables created and data inserted successfully.

In [52]:
sql = """
SELECT
    users.name AS user,
    products.name AS favorite_product
FROM
    users
INNER JOIN
    products ON users.fav = products.id;
"""

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')

In [56]:
sql = """
SELECT
    users.name AS user,
    products.name AS favorite_product
FROM
    users
LEFT JOIN
    products ON users.fav = products.id;
"""

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')
('Hannah', None)
('Michael', None)

In [54]:
sql = """
SELECT
    users.name AS user,
    products.name AS favorite_product
FROM
    users
RIGHT JOIN
    products ON users.fav = products.id;
"""

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Peter', 'Chocolate Heaven')
('John', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')
(None, 'Vanilla Dreams')

In [62]:
sql = """
SELECT
    users.name AS user,
    products.name AS favorite_product
FROM
    users,products
WHERE
    users.fav = products.id
"""

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')

In [71]:
cursor = mydb.cursor()

cursor.execute("""
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(255)
)
""")

cursor.execute("""
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(255)
)
""")

cursor.execute("""
CREATE TABLE favorites (
    employee_id INT,
    product_id INT,
    FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
)
""")

employees = [
    (1, 'John'),
    (2, 'Peter'),
    (3, 'Amy')
]

cursor.executemany("INSERT INTO employees (employee_id, name) VALUES (%s, %s)", employees)

products = [
    (154, 'Chocolate Heaven'),
    (155, 'Tasty Lemons'),
    (156, 'Vanilla Dreams')
]

cursor.executemany("INSERT INTO products (product_id, product_name) VALUES (%s, %s)", products)

favorites = [
    (1, 154),
    (2, 154),
    (3, 155)
]

cursor.executemany("INSERT INTO favorites (employee_id, product_id) VALUES (%s, %s)", favorites)


mydb.commit()

In [79]:
sql = """
SELECT
    e.name AS employee,
    p.product_name AS favorite_product
FROM
    employees e
INNER JOIN
    favorites f ON e.employee_id = f.employee_id
INNER JOIN
    products p ON f.product_id = p.product_id;
order by
    e.name
"""


cursor.execute(sql)

results = cursor.fetchall()

for row in results:
    print(row)

('John', 'Chocolate Heaven')
('Peter', 'Chocolate Heaven')
('Amy', 'Tasty Lemons')